Podkova/src/Enums/ТипыРасходов/ТипыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасходов</name>
  <enumValues>
    <name>ЗакупкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>СкладскоеХранение</name>
  </enumValues>
  <enumValues>
    <name>ПродажаТоваров</name>
  </enumValues>
  <enumValues>
    <name>Производственные</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеСтоимостиВНА</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/ТипыРасходов/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивИсключаемыхЗначений = Новый Массив;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВнеоборотныеАктивы2_2")
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьВнеоборотныеАктивы2_4") Тогда
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ТипыРасходов.ФормированиеСтоимостиВНА"));
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("УправлениеТорговлей") Тогда
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ТипыРасходов.Производственные"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ТипыРасходов.ФормированиеСтоимостиВНА"));
	КонецЕсли;
	
	ОбщегоНазначенияУТВызовСервера.ДоступныеДляВыбораЗначенияПеречисления(
		"ТипыРасходов",
		ДанныеВыбора,
		Параметры,
		МассивИсключаемыхЗначений);
	
КонецПроцедуры

#КонецОбласти
